/******************************************
 * @name 美图欣赏
 * @channel 
 * @feedback 
 * @update 2024515
 * @version 
 *脚本作者：TG人称～骚骚哥
******************************************
脚本声明:
1. 本脚本仅用于学习研究，禁止用于商业用途
2. 本脚本不保证准确性、可靠性、完整性和及时性
3. 任何个人或组织均可无需经过通知而自由使用
4. 作者对任何脚本问题概不负责，包括由此产生的任何损失
5. 如果任何单位或个人认为该脚本可能涉嫌侵犯其权利，应及时通知并提供身份证明、所有权证明，我将在收到认证文件确认后删除
6. 请勿将本脚本用于商业用途，由此引起的问题与作者无关
7. 本脚本及其更新版权归作者所有
********************* 𝐋𝐨𝐨𝐧 *********************

/BoxJs订阅：
/https://raw.githubusercontent.com/Yuheng0101/X/main/Tasks/boxjs.json

/图片地址：
/https://raw.githubusercontent.com/Yuheng0101/X/main/Assets/meitu.png

[Script]
cron "30 20 * * *" script-path=https://raw.githubusercontent.com/Yuheng0101/X/main/Tasks/meitu/meitu.js, timeout=10, tag=美图欣赏, img-url=https://raw.githubusercontent.com/Yuheng0101/X/main/Assets/meitu.png
